Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter.#ctor(System.Collections.Generic.IList{System.Double})
Creates object from an array of one-dimensional point coordinates
points:
Array of one-dimensional point coordinates representing domain points (using raw parameters when on a curve)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter
Represents a set of one-dimensional point coordinates (defined usually on curve)
Since:
2011